package com.company;

/*
 * Порождающие - создание объектов
 *   - singleton
 *   - factory method (известен интерфейс, но неизвестно какая из реализации интерфейс. Получение ссылки на объеки исходя из параметров
 *   - abstract factory (создание семейства объектов разных типов (у factory method один тип), объекты внутри фабрики связаны по смыслу или по задаче )
 * Структурные - изменение и доработка существующих интерфейсов
 *   - decorator
 *   - adapter
 *   - facade
 * Поведенчиские - взаимодействие между объектами, уменьшение связей
 *   - observer
 *   - strategy
 *   - state
 * */
public class Main {
    public static void main(String[] args)
    {

    }
}
